<template>
  <div>
    <!-- <el-button type="primary" size="default" @click="setHeader">设置表头</el-button> -->
    <el-button type="primary" size="default" @click="setData">设置数据</el-button>
    <!-- 在线预览容器 -->
    <div id="luckysheet"></div>
  </div>
</template>

<script setup>
import { onMounted, nextTick } from 'vue'

let headerData = [
  [
    {
      v: '部门',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '部门',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
      mc: {
        rs: 2,
        cs: 1,
        r: 0,
        c: 0,
      },
    },
    {
      v: '科目',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '科目',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
      mc: {
        rs: 2,
        cs: 1,
        r: 0,
        c: 1,
      },
    },
    {
      v: '事项',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '事项',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
      mc: {
        rs: 2,
        cs: 1,
        r: 0,
        c: 2,
      },
    },
    {
      v: '内容',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '内容',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
      mc: {
        rs: 2,
        cs: 1,
        r: 0,
        c: 3,
      },
    },
    {
      v: '2024年6月',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '2024年6月',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
      mc: {
        rs: 1,
        cs: 12,
        r: 0,
        c: 4,
      },
    },
    {
      mc: {
        r: 0,
        c: 4,
      },
    },
    {
      mc: {
        r: 0,
        c: 4,
      },
    },
    {
      mc: {
        r: 0,
        c: 4,
      },
    },
    {
      mc: {
        r: 0,
        c: 4,
      },
    },
    {
      mc: {
        r: 0,
        c: 4,
      },
    },
    {
      mc: {
        r: 0,
        c: 4,
      },
    },
    {
      mc: {
        r: 0,
        c: 4,
      },
    },
    {
      mc: {
        r: 0,
        c: 4,
      },
    },
    {
      mc: {
        r: 0,
        c: 4,
      },
    },
    {
      mc: {
        r: 0,
        c: 4,
      },
    },
    {
      mc: {
        r: 0,
        c: 4,
      },
    },
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
  ],
  [
    {
      mc: {
        r: 0,
        c: 0,
      },
    },
    {
      mc: {
        r: 0,
        c: 1,
      },
    },
    {
      mc: {
        r: 0,
        c: 2,
      },
    },
    {
      mc: {
        r: 0,
        c: 3,
      },
    },
    {
      v: '目标',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '目标',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
    },
    {
      v: '目标IYA',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '目标IYA',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
    },
    {
      v: '目标费比',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '目标费比',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
    },
    {
      v: '实际',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '实际',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
    },
    {
      v: '实际完成率',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '实际完成率',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
    },
    {
      v: '实际费比',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '实际费比',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
    },
    {
      v: '预估',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '预估',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
    },
    {
      v: '预估完成率',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '预估完成率',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
    },
    {
      v: '预估费比',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '预估费比',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
    },
    {
      v: '同期',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '同期',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
    },
    {
      v: '实际IYA',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '实际IYA',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
    },
    {
      v: '同期费比',
      ct: {
        fa: 'General',
        t: 'g',
      },
      m: '同期费比',
      bg: 'rgb(192, 192, 192)',
      bl: 0,
      it: 0,
      ff: 5,
      fs: 11,
      fc: 'rgb(0, 0, 0)',
      ht: 0,
      vt: 0,
    },
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
  ],
]

let celldata = []

headerData.forEach((header, rowIndex) => {
  header.forEach((item, columnIndex) => {
    celldata.push({
      r: rowIndex,
      c: columnIndex,
      v: item,
    })
  })
})
console.log(celldata)

nextTick(() => {
  var options = {
    container: 'luckysheet', //luckysheet为容器id
    lang: 'zh',
    title: '财务月报',
    showinfobar: false,
    data: [
      {
        name: 'Cell',
        celldata: celldata,
        index: 0, //工作表索引
        status: 1, //激活状态
        order: 0, //工作表的下标
        hide: 0, //是否隐藏
        calcChain: [
          // {
          //   r: 0, //行数
          //   c: 0, //列数
          //   index: 0,
          // },
        ],
      },
    ],
    hook: {
      cellUpdated: (r, c, oldValue, newValue) => {
        console.log(r, c, oldValue, newValue)
      },
    },
  }
  luckysheet.create(options)
})

function setHeader() {
  let data = [
    ['部门', '科目', '事项', '内容', '2024年6月', '', '', '', '', '', '', '', '', '', '', ''],
    ['', '', '', '', '目标', '目标IYA', '目标费比', '实际', '实际完成率', '实际费比', '预估', '预估完成率', '预估费比', '同期', '实际IYA', '同期费比'],
  ]
  mergeCellsAndSetValues(data, 0, 0, true)
}

function setData() {
  let data = [
    ['事业六部', 'GMV', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '平台佣金', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '产品成本', '采购折扣', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '平台费用小计', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '单量', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '前台销售毛利', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '营销推广费用合计', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '前台销售毛利', '前台销售毛利', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '商品成本合计', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '客单价', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '', '退后数量*RSP', '0', '0.00%', '0.00%', '0', '0.00%', '0.00%', '0', '0.00%', '0.00%', '0', '0.00%', '0.00%'],
    ['事业六部', '营销推广费用', '平台费用', '其他费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '退后GMV合计', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货货补', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货返利', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '资源费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '商品损耗', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货返利', '合同内月返', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '补贴后销售毛利', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '会员费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '淘客佣金', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '种草费用', '内容费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '合同目标GMV', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '产品成本', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货返利', '其他返利', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '保险费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售收入', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售收入', '销售收入', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '直播佣金', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '店播费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售收入', '销售净收入合计', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '种草费用', '达人费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '站内推广', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '种草费用', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '合同目标GMV', '合同目标GMV', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货返利', '合同内年返', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货返利', '合同内季返', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '信用手续费', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '退后GMV合计', 'TOC的退后GMV', '￥0.0', '0.00%', '', '￥0.0', '0.00%', '', '￥0.0', '0.00%', '', '￥0.0', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '推广费用小计', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '产品成本', '产品成本', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '种草费用', '投流费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '销售折扣', '', '0', '0.00%', '0.00%', '0', '0.00%', '0.00%', '0', '0.00%', '0.00%', '0', '0.00%', '0.00%'],
    ['事业六部', '销售成本', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '直播坑位费', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '补贴后销售毛利', '补贴后销售毛利', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '前台销售毛利', '前台销售毛利率', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '种草费用', '种草费用合计', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售收入', '销售收入', '销售回款', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', 'ISV费用', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '平台返点', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '软件费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '赠品成本', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售收入', '平台毛保', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '设计费用', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货返利', '返利合计', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '补贴后销售毛利', '补贴后销售毛利率', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '商品损耗', '销退未赔付、盘盈亏、报废等', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货货补', '（合同外）亏损补贴', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
  ]
  mergeCellsAndSetValues(data, 2, 0, false)
}

function mergeCellsAndSetValues(data = [], fromRows = 0, fromCells = 0, isMerge = false) {
  let setValues = [],
    mergeRange = []
  data.forEach((row, rowIndex) => {
    let temporaryRowValues = []
    row.map((cell, cellIndex) => {
      temporaryRowValues.push({
        v: cell,
        m: cell,
      })
      if (isMerge && cell && cell !== '') {
        let temporaryMergeRange = findMerge(rowIndex, cellIndex, data)
        if (temporaryMergeRange) mergeRange.push(temporaryMergeRange)
      }
    })
    setValues.push(temporaryRowValues)
  })
  let range = `${getColumnName(fromCells + 1)}${fromRows + 1}:${getColumnName(fromCells + setValues[0].length)}${fromRows + setValues.length}`
  console.log(setValues, range)
  luckysheet.setRangeValue(data, { range })
  console.log(mergeRange)
  if (mergeRange.length) luckysheet.setRangeMerge('all', { range: mergeRange })
}

function findMerge(rowIndex, cellIndex, data) {
  let currentValue = data[rowIndex][cellIndex]
  let temporaryCellIndex = cellIndex + 1,
    isContinueFindCellIndex = true
  while (isContinueFindCellIndex) {
    if (data[rowIndex][temporaryCellIndex] === '') {
      temporaryCellIndex += 1
    } else {
      isContinueFindCellIndex = false
    }
  }
  if (cellIndex + 1 !== temporaryCellIndex) {
    let range = {
      row: [rowIndex, rowIndex],
      column: [cellIndex, temporaryCellIndex - 1],
    }
    console.log(range)
    return range
  }
  let temporaryRowIndex = rowIndex + 1,
    isContinueFindRowIndex = true
  while (isContinueFindRowIndex) {
    if (data[temporaryRowIndex]) {
      if (data[temporaryRowIndex][cellIndex] === '') {
        temporaryRowIndex += 1
      } else {
        isContinueFindRowIndex = false
      }
    } else {
      isContinueFindRowIndex = false
    }
  }
  if (rowIndex + 1 !== temporaryRowIndex) {
    let range = {
      row: [rowIndex, temporaryRowIndex - 1],
      column: [cellIndex, cellIndex],
    }
    console.log(range)
    return range
  }
  return false
}

function getColumnName(num) {
  let columnName = ''
  while (num > 0) {
    let remainder = (num - 1) % 26
    columnName = String.fromCharCode(65 + remainder) + columnName
    num = Math.floor((num - 1) / 26)
  }
  return columnName
}
</script>
<style scoped>
#luckysheet {
  width: 100vw;
  height: 100vh;
}
</style>
