<template>
  <el-button type="primary" size="default" @click="setData">设置数据</el-button>
  <el-button type="primary" size="default" @click="getData">获取数据</el-button>
  <el-button type="primary" size="default" @click="setAllData">设置全量数据</el-button>

  <div id="univer-app" style="height: 95vh"></div>
</template>
<script setup>
const {
  UniverCore,
  UniverDesign,
  UniverEngineRender,
  UniverEngineFormula,
  UniverDocs,
  UniverDocsUi,
  UniverUi,
  UniverSheets,
  UniverSheetsUi,
  UniverSheetsNumfmt,
  UniverSheetsFormula,
  UniverFacade,
} = window
var univer = new UniverCore.Univer({
  theme: UniverDesign.defaultTheme,
  locale: UniverCore.LocaleType.ZH_CN,
  locales: {
    [UniverCore.LocaleType.ZH_CN]: UniverUMD['zh-CN'],
  },
})
univer.registerPlugin(UniverEngineRender.UniverRenderEnginePlugin)
univer.registerPlugin(UniverEngineFormula.UniverFormulaEnginePlugin)
univer.registerPlugin(UniverUi.UniverUIPlugin, {
  container: 'univer-app',
})
univer.registerPlugin(UniverDocs.UniverDocsPlugin, {
  hasScroll: false,
})
univer.registerPlugin(UniverDocsUi.UniverDocsUIPlugin)
univer.registerPlugin(UniverSheets.UniverSheetsPlugin)
univer.registerPlugin(UniverSheetsUi.UniverSheetsUIPlugin)
univer.registerPlugin(UniverSheetsNumfmt.UniverSheetsNumfmtPlugin)
univer.registerPlugin(UniverSheetsFormula.UniverSheetsFormulaPlugin)
univer.createUnit(UniverCore.UniverInstanceType.UNIVER_SHEET, {
  id: 'gyI0JO',
  sheetOrder: ['RSfWjJFv4opmE1JaiRj80'],
  name: '',
  appVersion: '0.1.11',
  locale: 'zhCN',
  styles: {
    header_style: {
      fs: 12,
      ht: 2,
      vt: 2,
      bg: {
        rgb: '#909399',
      },
      bd: {
        // 上边框
        t: {
          s: 1, // 边框样式
          cl: {
            // 边框颜色
            rgb: '#00000',
          },
        },
        // 下边框
        b: {
          s: 1, // 边框样式
          cl: {
            // 边框颜色
            rgb: '#00000',
          },
        },
        // 左边框
        l: {
          s: 1, // 边框样式
          cl: {
            // 边框颜色
            rgb: '#00000',
          },
        },
        // 右边框
        r: {
          s: 1, // 边框样式
          cl: {
            // 边框颜色
            rgb: '#00000',
          },
        },
      },
    },
  },
  sheets: {
    RSfWjJFv4opmE1JaiRj80: {
      id: 'RSfWjJFv4opmE1JaiRj80',
      name: '数据源',
      tabColor: '',
      hidden: 0,
      rowCount: 65,
      columnCount: 16,
      zoomRatio: 1,
      freeze: {
        startRow: -1,
        startColumn: -1,
        ySplit: 0,
        xSplit: 0,
      },
      scrollTop: 0,
      scrollLeft: 0,
      defaultColumnWidth: 73,
      defaultRowHeight: 23,
      mergeData: [
        { startRow: 0, startColumn: 0, endRow: 1, endColumn: 0 },
        { startRow: 0, startColumn: 1, endRow: 1, endColumn: 1 },
        { startRow: 0, startColumn: 2, endRow: 1, endColumn: 2 },
        { startRow: 0, startColumn: 3, endRow: 1, endColumn: 3 },
        { startRow: 0, startColumn: 4, endRow: 0, endColumn: 16 },
      ],
      cellData: {
        0: {
          0: { v: '部门', s: 'header_style' },
          1: { v: '科目', s: 'header_style' },
          2: { v: '事项', s: 'header_style' },
          3: { v: '内容', s: 'header_style' },
          4: { v: '2024年6月', s: 'header_style' },
          5: { v: '', s: 'header_style' },
          6: { v: '', s: 'header_style' },
          7: { v: '', s: 'header_style' },
          8: { v: '', s: 'header_style' },
          9: { v: '', s: 'header_style' },
          10: { v: '', s: 'header_style' },
          11: { v: '', s: 'header_style' },
          12: { v: '', s: 'header_style' },
          13: { v: '', s: 'header_style' },
          14: { v: '', s: 'header_style' },
          15: { v: '', s: 'header_style' },
        },
        1: {
          0: { v: '', s: 'header_style' },
          1: { v: '', s: 'header_style' },
          2: { v: '', s: 'header_style' },
          3: { v: '', s: 'header_style' },
          4: { v: '目标', s: 'header_style' },
          5: { v: '目标IYA', s: 'header_style' },
          6: { v: '目标费比', s: 'header_style' },
          7: { v: '实际', s: 'header_style' },
          8: { v: '实际完成率', s: 'header_style' },
          9: { v: '实际费比', s: 'header_style' },
          10: { v: '预估', s: 'header_style' },
          11: { v: '预估完成率', s: 'header_style' },
          12: { v: '预估费比', s: 'header_style' },
          13: { v: '同期', s: 'header_style' },
          14: { v: '实际IYA', s: 'header_style' },
          15: { v: '同期费比', s: 'header_style' },
        },
      },
      rowData: {},
      columnData: {},
      showGridlines: 1,
      rowHeader: {
        width: 46,
        hidden: 0,
      },
      columnHeader: {
        height: 20,
        hidden: 0,
      },
      rightToLeft: 0,
    },
  },
  resources: [
    {
      name: 'SHEET_DEFINED_NAME_PLUGIN',
      data: '',
    },
  ],
})
const univerAPI = UniverFacade.FUniver.newAPI(univer)

function setData() {
  const sheets = univerAPI.getActiveWorkbook().getSnapshot().sheets
  console.log(sheets['RSfWjJFv4opmE1JaiRj80'])
  const activeSheet = univerAPI.getActiveWorkbook().getActiveSheet()
  console.log(activeSheet)
  let data = [
    ['事业六部', 'GMV', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '平台佣金', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '产品成本', '采购折扣', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '平台费用小计', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '单量', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '前台销售毛利', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '营销推广费用合计', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '前台销售毛利', '前台销售毛利', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '商品成本合计', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '客单价', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '', '退后数量*RSP', '0', '0.00%', '0.00%', '0', '0.00%', '0.00%', '0', '0.00%', '0.00%', '0', '0.00%', '0.00%'],
    ['事业六部', '营销推广费用', '平台费用', '其他费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '退后GMV合计', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货货补', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货返利', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '资源费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '商品损耗', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货返利', '合同内月返', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '补贴后销售毛利', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '会员费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '淘客佣金', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '种草费用', '内容费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '合同目标GMV', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '产品成本', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货返利', '其他返利', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '保险费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售收入', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售收入', '销售收入', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '直播佣金', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '店播费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售收入', '销售净收入合计', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '种草费用', '达人费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '站内推广', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '种草费用', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '合同目标GMV', '合同目标GMV', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货返利', '合同内年返', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货返利', '合同内季返', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '信用手续费', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '退后GMV合计', 'TOC的退后GMV', '￥0.0', '0.00%', '', '￥0.0', '0.00%', '', '￥0.0', '0.00%', '', '￥0.0', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '推广费用小计', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '产品成本', '产品成本', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '种草费用', '投流费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', 'GMV', '销售折扣', '', '0', '0.00%', '0.00%', '0', '0.00%', '0.00%', '0', '0.00%', '0.00%', '0', '0.00%', '0.00%'],
    ['事业六部', '销售成本', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '推广费用', '直播坑位费', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '补贴后销售毛利', '补贴后销售毛利', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '前台销售毛利', '前台销售毛利率', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '种草费用', '种草费用合计', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售收入', '销售收入', '销售回款', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', 'ISV费用', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '平台返点', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '平台费用', '软件费用', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '赠品成本', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售收入', '平台毛保', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '营销推广费用', '设计费用', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货返利', '返利合计', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '补贴后销售毛利', '补贴后销售毛利率', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '商品损耗', '销退未赔付、盘盈亏、报废等', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
    ['事业六部', '销售成本', '进货货补', '（合同外）亏损补贴', '', '0.00%', '', '', '0.00%', '', '', '0.00%', '', '', '0.00%', ''],
  ]
  const range1 = activeSheet.getRange(2, 0, data.length, data[0].length)
  range1.setValues(data)
}

let currentEditRange = {
  startColumn: null,
  startRow: null,
  endColumn: null,
  endRow: null,
}

univerAPI.onCommandExecuted((command) => {
  if (command.id === 'sheet.operation.set-cell-edit-visible' && command.params.visible) {
    console.log('Cell edit visible')
    const activeSheet = univerAPI.getActiveWorkbook().getActiveSheet()
    const selection = activeSheet.getSelection()
    const range = selection.getActiveRange()
    currentEditRange.startRow = range._range.startRow
    currentEditRange.startColumn = range._range.startColumn
    currentEditRange.endRow = range._range.endRow
    currentEditRange.endColumn = range._range.endColumn
  }
})

univerAPI.onCommandExecuted((command) => {
  if (command.id === 'sheet.operation.set-cell-edit-visible' && !command.params.visible) {
    console.log('Cell edit invisible')
    const activeSheet = univerAPI.getActiveWorkbook().getActiveSheet()
    const range = activeSheet.getRange(currentEditRange.startRow, currentEditRange.startColumn, currentEditRange.endRow, currentEditRange.endColumn)
    const value = range.getValue()
    console.log('修改单元格', currentEditRange, '改后的值', value)
  }
})

function getData() {
  console.log(univerAPI.getActiveWorkbook().getSnapshot())
}

function setAllData() {
  univer.createUnit(UniverCore.UniverInstanceType.UNIVER_SHEET, {
    id: 'gyI0JO',
    sheetOrder: ['RSfWjJFv4opmE1JaiRj80'],
    name: '',
    appVersion: '0.1.11',
    locale: 'zhCN',
    styles: {
      qI9Wou: {
        ff: '宋体',
        fs: 11,
        it: 0,
        bl: 0,
        ul: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        st: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        ol: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        tr: {
          a: 0,
          v: 0,
        },
        td: 0,
        cl: {
          rgb: 'rgb(0,0,0)',
        },
        bg: {
          rgb: 'rgb(192,192,192)',
        },
        ht: 0,
        vt: 2,
        tb: 1,
        pd: {
          t: 0,
          b: 1,
          l: 2,
          r: 2,
        },
        bd: {
          l: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          r: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          t: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          b: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
        },
      },
      C61YXJ: {
        ff: '宋体',
        fs: 11,
        it: 0,
        bl: 0,
        ul: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        st: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        ol: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        tr: {
          a: 0,
          v: 0,
        },
        td: 0,
        cl: {
          rgb: 'rgb(0,0,0)',
        },
        ht: 2,
        vt: 2,
        tb: 1,
        pd: {
          t: 0,
          b: 1,
          l: 2,
          r: 2,
        },
        bd: {
          l: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          r: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          t: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          b: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
        },
      },
      Q8MYxG: {
        ff: '宋体',
        fs: 11,
        it: 0,
        bl: 0,
        ul: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        st: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        ol: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        tr: {
          a: 0,
          v: 0,
        },
        td: 0,
        cl: {
          rgb: 'rgb(0,0,0)',
        },
        ht: 2,
        vt: 2,
        tb: 1,
        pd: {
          t: 0,
          b: 1,
          l: 2,
          r: 2,
        },
        bd: {
          l: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          r: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          t: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          b: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
        },
        n: {
          pattern: '#,##0.00',
        },
      },
      g7psGW: {
        ff: '宋体',
        fs: 11,
        it: 0,
        bl: 0,
        ul: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        st: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        ol: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        tr: {
          a: 0,
          v: 0,
        },
        td: 0,
        cl: {
          rgb: 'rgb(0,0,0)',
        },
        ht: 2,
        vt: 2,
        tb: 1,
        pd: {
          t: 0,
          b: 1,
          l: 2,
          r: 2,
        },
        bd: {
          l: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          r: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          t: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          b: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
        },
        n: {
          pattern: '0.00%',
        },
      },
      hl_GFU: {
        ff: '宋体',
        fs: 11,
        it: 0,
        bl: 0,
        ul: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        st: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        ol: {
          s: 0,
          cl: {
            rgb: 'rgb(0,0,0)',
          },
        },
        tr: {
          a: 0,
          v: 0,
        },
        td: 0,
        cl: {
          rgb: 'rgb(0,0,0)',
        },
        ht: 2,
        vt: 2,
        tb: 1,
        pd: {
          t: 0,
          b: 1,
          l: 2,
          r: 2,
        },
        bd: {
          l: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          r: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          t: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
          b: {
            cl: {
              rgb: 'rgb(0,0,0)',
            },
            s: 1,
          },
        },
        n: {
          pattern: '#,##0',
        },
      },
    },
    sheets: {
      RSfWjJFv4opmE1JaiRj80: {
        id: 'RSfWjJFv4opmE1JaiRj80',
        name: '数据源',
        tabColor: '',
        hidden: 0,
        rowCount: 217,
        columnCount: 16,
        zoomRatio: 1,
        freeze: {
          startRow: -1,
          startColumn: -1,
          ySplit: 0,
          xSplit: 0,
        },
        scrollTop: 0,
        scrollLeft: 0,
        defaultColumnWidth: 73,
        defaultRowHeight: 23,
        rowData: {},
        columnData: {},
        showGridlines: 1,
        rowHeader: {
          width: 46,
          hidden: 0,
        },
        columnHeader: {
          height: 20,
          hidden: 0,
        },
        rightToLeft: 0,
        mergeData: [],
        cellData: {
          0: {
            0: {
              v: '部门',
              t: 1,
            },
            1: {
              v: '科目',
              t: 1,
            },
            2: {
              v: '事项',
              t: 1,
            },
            3: {
              v: '内容',
              t: 1,
            },
            4: {
              v: '年份',
              t: 1,
            },
            5: {
              v: '月份',
              t: 1,
            },
            6: {
              v: '实际值',
              t: 1,
            },
            7: {
              v: '目标值',
              t: 1,
            },
            8: {
              v: '预估值',
              t: 1,
            },
            9: {
              v: '同期值',
              t: 1,
            },
          },
          1: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: 'RSP(退货后)',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 34832471.12,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          2: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: '销售折扣',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: '0.00%',
              t: 1,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          3: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: '退后GMV合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          4: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: '合同目标GMV',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          5: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售收入',
              t: 1,
            },
            2: {
              v: '销售收入',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 14551849.12,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          6: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售收入',
              t: 1,
            },
            2: {
              v: '平台毛保',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          7: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售收入',
              t: 1,
            },
            2: {
              v: '销售净收入合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 14551849.12,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          8: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '产品成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 11488581.81,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          9: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '赠品成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          10: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '商品损耗',
              t: 1,
            },
            3: {
              v: '盘盈亏、报废等',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          11: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '进货返利',
              t: 1,
            },
            3: {
              v: '（合同内）月返、季返、年返',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: -2018279.35,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          12: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '进货货补',
              t: 1,
            },
            3: {
              v: '（合同外）亏损补贴',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          13: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '商品成本合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 9470302.46,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          14: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '前台销售毛利',
              t: 1,
            },
            2: {
              v: '前台销售毛利',
              t: 1,
            },
            3: {
              v: '仅前台销售利润',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 3063267.31,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          15: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '前台销售毛利',
              t: 1,
            },
            2: {
              v: '前台销售毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0.21050000000000002,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          16: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售毛利',
              t: 1,
            },
            2: {
              v: '销售毛利',
              t: 1,
            },
            3: {
              v: '含赠品、商品损耗、补贴后',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 5081546.66,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          17: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售毛利',
              t: 1,
            },
            2: {
              v: '销售毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0.3492,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          18: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '运营人力成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 486827.02,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          19: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '运营人数',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          20: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '客服成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 168510.97,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          21: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '客服人数',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          22: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '供应链成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          23: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '供应链人数',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          24: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '大促成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          25: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '人力成本合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 655337.99,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          26: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '平台费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 786300.23,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          27: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '推广费用',
              t: 1,
            },
            3: {
              v: '站内推广（指有ROI交付的）',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 1137523.86,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          28: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '种草费用',
              t: 1,
            },
            3: {
              v: '站外推广，如抖音、小红书推广等',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          29: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: 'ISV费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          30: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '设计费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          31: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '推广费用合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 1923824.09,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          32: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '仓配费用',
              t: 1,
            },
            2: {
              v: '',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 1116627.4,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          33: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '运营费用',
              t: 1,
            },
            2: {
              v: '',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 4461.05,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          34: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '跨境综合税',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          35: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '消费税',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          36: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '附加税',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          37: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '财务费用/汇率成本',
              t: 1,
            },
            3: {
              v: '汇率波动对损益的影响',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          38: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '财务费用/资金占用',
              t: 1,
            },
            3: {
              v: '垫付资金、库存资金',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          39: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '税费合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          40: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '费用合计',
              t: 1,
            },
            2: {
              v: '',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 3700250.53,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          41: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '运营毛利',
              t: 1,
            },
            2: {
              v: '运营毛利',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 1381296.13,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          42: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '运营毛利',
              t: 1,
            },
            2: {
              v: '运营毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0.0949,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          43: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '品牌补贴',
              t: 1,
            },
            2: {
              v: '合同内补贴',
              t: 1,
            },
            3: {
              v: '现金补贴',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 424528.3,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          44: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '品牌补贴',
              t: 1,
            },
            2: {
              v: '合同外补贴',
              t: 1,
            },
            3: {
              v: '现金补贴',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          45: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '品牌补贴',
              t: 1,
            },
            2: {
              v: '品牌补贴合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 424528.3,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          46: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '综合毛利',
              t: 1,
            },
            2: {
              v: '综合毛利',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 1805824.43,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          47: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '综合毛利',
              t: 1,
            },
            2: {
              v: '综合毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0.1241,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          48: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '存货减值准备',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          49: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '应收账款减值准备',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          50: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '减值准备合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          51: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '考核毛利',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 1805824.43,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          52: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税前利润',
              t: 1,
            },
            2: {
              v: '管理费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          53: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税前利润',
              t: 1,
            },
            2: {
              v: '中台分摊',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: '',
              t: 1,
            },
            7: {
              v: '',
              t: 1,
            },
            8: {
              v: '',
              t: 1,
            },
            9: {
              v: '',
              t: 1,
            },
          },
          54: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税前利润',
              t: 1,
            },
            2: {
              v: '税前利润',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 1805824,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          55: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: 'RSP(退货后)',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 34119315.4,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          56: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: '销售折扣',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0.4757,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          57: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: '退后GMV合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 16228917.87,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          58: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: '合同目标GMV',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 25000000,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          59: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售收入',
              t: 1,
            },
            2: {
              v: '销售收入',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 16794718.45,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          60: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售收入',
              t: 1,
            },
            2: {
              v: '平台毛保',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          61: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售收入',
              t: 1,
            },
            2: {
              v: '销售净收入合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 16794718.45,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          62: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '产品成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: -251716.02,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          63: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '赠品成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          64: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '商品损耗',
              t: 1,
            },
            3: {
              v: '盘盈亏、报废等',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          65: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '进货返利',
              t: 1,
            },
            3: {
              v: '（合同内）月返、季返、年返',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          66: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '进货货补',
              t: 1,
            },
            3: {
              v: '（合同外）亏损补贴',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          67: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '商品成本合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: -251716.02,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          68: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '前台销售毛利',
              t: 1,
            },
            2: {
              v: '前台销售毛利',
              t: 1,
            },
            3: {
              v: '仅前台销售利润',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 17046434.47,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          69: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '前台销售毛利',
              t: 1,
            },
            2: {
              v: '前台销售毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 1.0150000000000001,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          70: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售毛利',
              t: 1,
            },
            2: {
              v: '销售毛利',
              t: 1,
            },
            3: {
              v: '含赠品、商品损耗、补贴后',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 17046434.47,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          71: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '销售毛利',
              t: 1,
            },
            2: {
              v: '销售毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 1.0150000000000001,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          72: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '运营人力成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 511155.06,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          73: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '运营人数',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 47.1,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          74: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '客服成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 185810.54,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          75: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '客服人数',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          76: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '供应链成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 2711.72,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          77: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '供应链人数',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0.5,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          78: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '大促成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 113861.85,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          79: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '人力成本合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 813539.17,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          80: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '平台费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 892316.27,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          81: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '推广费用',
              t: 1,
            },
            3: {
              v: '站内推广（指有ROI交付的）',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 1268124.8,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          82: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '种草费用',
              t: 1,
            },
            3: {
              v: '站外推广，如抖音、小红书推广等',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          83: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: 'ISV费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          84: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '设计费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          85: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '推广费用合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 2160441.07,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          86: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '仓配费用',
              t: 1,
            },
            2: {
              v: '',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 1194556.48,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          87: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '运营费用',
              t: 1,
            },
            2: {
              v: '',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 3283.19,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          88: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '跨境综合税',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          89: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '消费税',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          90: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '附加税',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          91: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '财务费用/汇率成本',
              t: 1,
            },
            3: {
              v: '汇率波动对损益的影响',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          92: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '财务费用/资金占用',
              t: 1,
            },
            3: {
              v: '垫付资金、库存资金',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          93: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '税费合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          94: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '费用合计',
              t: 1,
            },
            2: {
              v: '',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 4171819.91,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          95: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '运营毛利',
              t: 1,
            },
            2: {
              v: '运营毛利',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 12874614.56,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          96: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '运营毛利',
              t: 1,
            },
            2: {
              v: '运营毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0.7666,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          97: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '品牌补贴',
              t: 1,
            },
            2: {
              v: '合同内补贴',
              t: 1,
            },
            3: {
              v: '现金补贴',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          98: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '品牌补贴',
              t: 1,
            },
            2: {
              v: '合同外补贴',
              t: 1,
            },
            3: {
              v: '现金补贴',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          99: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '品牌补贴',
              t: 1,
            },
            2: {
              v: '品牌补贴合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          100: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '综合毛利',
              t: 1,
            },
            2: {
              v: '综合毛利',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 12874614.56,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          101: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '综合毛利',
              t: 1,
            },
            2: {
              v: '综合毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0.7666,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          102: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '存货减值准备',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          103: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '应收账款减值准备',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          104: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '减值准备合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          105: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '考核毛利',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 12874614.56,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          106: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税前利润',
              t: 1,
            },
            2: {
              v: '管理费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 251250,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          107: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税前利润',
              t: 1,
            },
            2: {
              v: '中台分摊',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 385775.05,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          108: {
            0: {
              v: '曼秀雷敦',
              t: 1,
            },
            1: {
              v: '税前利润',
              t: 1,
            },
            2: {
              v: '税前利润',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 12237590,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          109: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: 'RSP(退货后)',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 524752.1,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          110: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: '销售折扣',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0.618,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          111: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: '退后GMV合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 324309.18,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          112: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: '合同目标GMV',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          113: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售收入',
              t: 1,
            },
            2: {
              v: '销售收入',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 285063.38,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          114: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售收入',
              t: 1,
            },
            2: {
              v: '平台毛保',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          115: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售收入',
              t: 1,
            },
            2: {
              v: '销售净收入合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 285063.38,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          116: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '产品成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 286316.52,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          117: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '赠品成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          118: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '商品损耗',
              t: 1,
            },
            3: {
              v: '盘盈亏、报废等',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          119: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '进货返利',
              t: 1,
            },
            3: {
              v: '（合同内）月返、季返、年返',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: -57623.38,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          120: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '进货货补',
              t: 1,
            },
            3: {
              v: '（合同外）亏损补贴',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          121: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '商品成本合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 228693.14,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          122: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '前台销售毛利',
              t: 1,
            },
            2: {
              v: '前台销售毛利',
              t: 1,
            },
            3: {
              v: '仅前台销售利润',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: -1253.14,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          123: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '前台销售毛利',
              t: 1,
            },
            2: {
              v: '前台销售毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: -0.0044,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          124: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售毛利',
              t: 1,
            },
            2: {
              v: '销售毛利',
              t: 1,
            },
            3: {
              v: '含赠品、商品损耗、补贴后',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 56370.24,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          125: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售毛利',
              t: 1,
            },
            2: {
              v: '销售毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0.1977,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          126: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '运营人力成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          127: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '运营人数',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          128: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '客服成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          129: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '客服人数',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          130: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '供应链成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          131: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '供应链人数',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          132: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '大促成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          133: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '人力成本合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          134: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '平台费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 5573.92,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          135: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '推广费用',
              t: 1,
            },
            3: {
              v: '站内推广（指有ROI交付的）',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 64541.68,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          136: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '种草费用',
              t: 1,
            },
            3: {
              v: '站外推广，如抖音、小红书推广等',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          137: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: 'ISV费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          138: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '设计费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          139: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '推广费用合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 70115.6,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          140: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '仓配费用',
              t: 1,
            },
            2: {
              v: '',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 27917.56,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          141: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '运营费用',
              t: 1,
            },
            2: {
              v: '',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          142: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '跨境综合税',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          143: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '消费税',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          144: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '附加税',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          145: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '财务费用/汇率成本',
              t: 1,
            },
            3: {
              v: '汇率波动对损益的影响',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          146: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '财务费用/资金占用',
              t: 1,
            },
            3: {
              v: '垫付资金、库存资金',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          147: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '税费合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          148: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '费用合计',
              t: 1,
            },
            2: {
              v: '',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 98033.16,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          149: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '运营毛利',
              t: 1,
            },
            2: {
              v: '运营毛利',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: -41662.92,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          150: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '运营毛利',
              t: 1,
            },
            2: {
              v: '运营毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: -0.1462,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          151: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '品牌补贴',
              t: 1,
            },
            2: {
              v: '合同内补贴',
              t: 1,
            },
            3: {
              v: '现金补贴',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 5671.94,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          152: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '品牌补贴',
              t: 1,
            },
            2: {
              v: '合同外补贴',
              t: 1,
            },
            3: {
              v: '现金补贴',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          153: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '品牌补贴',
              t: 1,
            },
            2: {
              v: '品牌补贴合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 5671.94,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          154: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '综合毛利',
              t: 1,
            },
            2: {
              v: '综合毛利',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: -35990.98,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          155: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '综合毛利',
              t: 1,
            },
            2: {
              v: '综合毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: -0.12630000000000002,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          156: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '存货减值准备',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          157: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '应收账款减值准备',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          158: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '减值准备合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          159: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '考核毛利',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: -35990.98,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          160: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税前利润',
              t: 1,
            },
            2: {
              v: '管理费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          161: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税前利润',
              t: 1,
            },
            2: {
              v: '中台分摊',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: '',
              t: 1,
            },
            7: {
              v: '',
              t: 1,
            },
            8: {
              v: '',
              t: 1,
            },
            9: {
              v: '',
              t: 1,
            },
          },
          162: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税前利润',
              t: 1,
            },
            2: {
              v: '税前利润',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 5,
              t: 2,
            },
            6: {
              v: -35991,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          163: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: 'RSP(退货后)',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 1398938.3,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          164: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: '销售折扣',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0.4115,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          165: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: '退后GMV合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 575643.23,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          166: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: 'GMV',
              t: 1,
            },
            2: {
              v: '合同目标GMV',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          167: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售收入',
              t: 1,
            },
            2: {
              v: '销售收入',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 478741.37,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          168: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售收入',
              t: 1,
            },
            2: {
              v: '平台毛保',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          169: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售收入',
              t: 1,
            },
            2: {
              v: '销售净收入合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 478741.37,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          170: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '产品成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: -8660.74,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          171: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '赠品成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          172: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '商品损耗',
              t: 1,
            },
            3: {
              v: '盘盈亏、报废等',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          173: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '进货返利',
              t: 1,
            },
            3: {
              v: '（合同内）月返、季返、年返',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          174: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '进货货补',
              t: 1,
            },
            3: {
              v: '（合同外）亏损补贴',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          175: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售成本',
              t: 1,
            },
            2: {
              v: '商品成本合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: -8660.74,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          176: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '前台销售毛利',
              t: 1,
            },
            2: {
              v: '前台销售毛利',
              t: 1,
            },
            3: {
              v: '仅前台销售利润',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 487402.11,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          177: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '前台销售毛利',
              t: 1,
            },
            2: {
              v: '前台销售毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 1.0181,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          178: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售毛利',
              t: 1,
            },
            2: {
              v: '销售毛利',
              t: 1,
            },
            3: {
              v: '含赠品、商品损耗、补贴后',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 487402.11,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          179: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '销售毛利',
              t: 1,
            },
            2: {
              v: '销售毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 1.0181,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          180: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '运营人力成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          181: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '运营人数',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          182: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '客服成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          183: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '客服人数',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          184: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '供应链成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          185: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '供应链人数',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          186: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '大促成本',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          187: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '人力成本',
              t: 1,
            },
            2: {
              v: '人力成本合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          188: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '平台费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 10609.02,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          189: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '推广费用',
              t: 1,
            },
            3: {
              v: '站内推广（指有ROI交付的）',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 82468.58,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          190: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '种草费用',
              t: 1,
            },
            3: {
              v: '站外推广，如抖音、小红书推广等',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          191: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: 'ISV费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          192: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '设计费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          193: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '营销推广费用',
              t: 1,
            },
            2: {
              v: '推广费用合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 93077.6,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          194: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '仓配费用',
              t: 1,
            },
            2: {
              v: '',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 58459.52,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          195: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '运营费用',
              t: 1,
            },
            2: {
              v: '',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 5170.59,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          196: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '跨境综合税',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          197: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '消费税',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          198: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '附加税',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          199: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '财务费用/汇率成本',
              t: 1,
            },
            3: {
              v: '汇率波动对损益的影响',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          200: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '财务费用/资金占用',
              t: 1,
            },
            3: {
              v: '垫付资金、库存资金',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          201: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税费成本',
              t: 1,
            },
            2: {
              v: '税费合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          202: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '费用合计',
              t: 1,
            },
            2: {
              v: '',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 156707.71,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          203: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '运营毛利',
              t: 1,
            },
            2: {
              v: '运营毛利',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 330694.4,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          204: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '运营毛利',
              t: 1,
            },
            2: {
              v: '运营毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0.6908,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          205: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '品牌补贴',
              t: 1,
            },
            2: {
              v: '合同内补贴',
              t: 1,
            },
            3: {
              v: '现金补贴',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 8838.06,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          206: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '品牌补贴',
              t: 1,
            },
            2: {
              v: '合同外补贴',
              t: 1,
            },
            3: {
              v: '现金补贴',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          207: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '品牌补贴',
              t: 1,
            },
            2: {
              v: '品牌补贴合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 8838.06,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          208: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '综合毛利',
              t: 1,
            },
            2: {
              v: '综合毛利',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 339532.46,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          209: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '综合毛利',
              t: 1,
            },
            2: {
              v: '综合毛利率',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0.7092,
              t: 2,
            },
            7: {
              v: '0.00%',
              t: 1,
            },
            8: {
              v: '0.00%',
              t: 1,
            },
            9: {
              v: '0.00%',
              t: 1,
            },
          },
          210: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '存货减值准备',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          211: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '应收账款减值准备',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          212: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '减值准备合计',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          213: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '考核毛利',
              t: 1,
            },
            2: {
              v: '考核毛利',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 339532.46,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          214: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税前利润',
              t: 1,
            },
            2: {
              v: '管理费用',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          215: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税前利润',
              t: 1,
            },
            2: {
              v: '中台分摊',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 0,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
          216: {
            0: {
              v: '伊利奶粉抖音店',
              t: 1,
            },
            1: {
              v: '税前利润',
              t: 1,
            },
            2: {
              v: '税前利润',
              t: 1,
            },
            3: {
              v: '',
              t: 1,
            },
            4: {
              v: 2024,
              t: 2,
            },
            5: {
              v: 6,
              t: 2,
            },
            6: {
              v: 339532,
              t: 2,
            },
            7: {
              v: 0,
              t: 2,
            },
            8: {
              v: 0,
              t: 2,
            },
            9: {
              v: 0,
              t: 2,
            },
          },
        },
      },
    },
    resources: [
      {
        name: 'SHEET_WORKSHEET_PROTECTION_PLUGIN',
        data: '{}',
      },
      {
        name: 'SHEET_WORKSHEET_PROTECTION_POINT_PLUGIN',
        data: '{}',
      },
      {
        name: 'SHEET_RANGE_PROTECTION_PLUGIN',
        data: '',
      },
      {
        name: 'SHEET_DEFINED_NAME_PLUGIN',
        data: '{}',
      },
      {
        name: 'SHEET_AuthzIoMockService_PLUGIN',
        data: '{}',
      },
    ],
  })
}
</script>
<style lang="scss" scoped></style>
